alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PMU</name>
			<description>PMU</description>
			<baseAddress>0x50004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MON_CNF</name>
					<description>Settings Monitor 1</description>
					<addressOffset>0x034</addressOffset>
					<size>8</size>
					<resetValue>#01000111</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>STS</name>
							<description>MON Status Input</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MON input has low status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MON input has high status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PU</name>
							<description>Pull-Up Current Source for MON Input Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up source disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up source enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD</name>
							<description>Pull-Down Current Source for MON Input Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down source disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-down source enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC</name>
							<description>MON for Cycle Sense Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Cycle Sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Cycle Sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RISE</name>
							<description>MON Wake-up on Rising Edge Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FALL</name>
							<description>MON Wake-up on Falling Edge Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>MON Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MON disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MON enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMU_SUPPLY_STS</name>
					<description>Voltage Reg Status Register</description>
					<addressOffset>0x004</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11001100</resetMask>
					<fields>
						<field>
							<name>PMU_5V_FAIL_EN</name>
							<description>Enabling of VDDP status information as interrupt source</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No interrupts are generated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupts are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERLOAD</name>
							<description>Overload at VDDP regulator</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overload</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERVOLT</name>
							<description>Overvoltage at VDDP regulator</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overvoltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overvoltage</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_FAIL_EN</name>
							<description>Enabling of VDDC status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No interrupts are generated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupts are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERLOAD</name>
							<description>Overload at VDDC regulator</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overload</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERVOLT</name>
							<description>Overvoltage at VDDC regulator</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overvoltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overvoltage</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VDDEXT_CTRL</name>
					<description>VDDEXT Control</description>
					<addressOffset>0x08</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#00001111</resetMask>
					<fields>
						<field>
							<name>STABLE</name>
							<description>VDDEXT Supply works inside its specified range 1</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT Voltage inside of specified range</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT Voltage outside of specified range</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OK</name>
							<description>VDDEXT Supply works inside its specified range 2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT in low drop mode</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT not in low drop mode</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVERLOAD</name>
							<description>VDDEXT Supply Overload</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT not in overload condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT in overload condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVERVOLT</name>
							<description>VDDEXT Supply Overvoltage</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT not in overvoltage condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT in overvoltage condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SHORT</name>
							<description>VDDEXT Supply Shorted Output</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT no short circuit</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT short circuit</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAIL_EN</name>
							<description>Enabling of VDDEXT Supply status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT fail interrupts are disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT fail Interrupts are enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_EN</name>
							<description>VDDEXT Supply for Cyclic Sense Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT for cyclic sense disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT for cyclic sense enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>VDDEXT Supply Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT Supply disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT supply enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_FAIL_STS</name>
					<description>System Fail Status Register</description>
					<addressOffset>0x070</addressOffset>
					<size>8</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WDT1_SEQ_FAIL</name>
							<description>External Watchdog (WDT1) Sequential Fail</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Fail</name>
									<description>System working properly</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequential Watchdog Fail</name>
									<description>5 consecutive watchdog fails</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT</name>
							<description>System Overtemperature Indication Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overtemperature</name>
									<description>System ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>System Overtemperature</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVL</name>
							<description>VDDP Overload Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overload</name>
									<description>VDDP ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<description>VDDP Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVL</name>
							<description>VDDC Overload Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overload</name>
									<description>VDDC ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<description>Hall VDDC Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPP_TMOUT</name>
							<description>Supply Time Out</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Main Supply ok</name>
									<description>VDDP or VDDC are in expected range</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Main Supply fail</name>
									<description>VDDP or VDDC do not have stable operating point</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPP_SHORT</name>
							<description>Supply Short</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Main Supply ok</name>
									<description>VDDP or VDDC are in expected range</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Main Supply short</name>
									<description>VDDP or VDDC do not have stable operating point</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STS_FAIL</name>
					<description>Wake Status Fail Register</description>
					<addressOffset>0x080</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>VDDEXTSHORT</name>
							<description>Stop-Exit due to short circuit at the VDDEXT Supply</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No short circuit</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Short circuit</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPPFAIL</name>
							<description>Stop-Exit due to overvoltage at the VDDEXT Supply</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overvoltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Module suspend enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO0_RISE</name>
					<description>Wake Configuration GPIO Port 0 Rising Edge Register</description>
					<addressOffset>0xD8</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_RI_4</name>
							<description>Port 0_4 Wake-up on Rising Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_3</name>
							<description>Port 0_3 Wake-up on Rising Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_2</name>
							<description>Port 0_2 Wake-up on Rising Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_1</name>
							<description>Port 0_1 Wake-up on Rising Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_0</name>
							<description>Port 0_0 Wake-up on Rising Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
