alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
				<register>
					<name>WAKE_CONF_GPIO0_FALL</name>
					<description>Wake Configuration GPIO Port 0 Falling Edge Register</description>
					<addressOffset>0xDC</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_FA_4</name>
							<description>Port 0_4 Wake-up on Falling Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_3</name>
							<description>Port 0_3 Wake-up on Falling Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_2</name>
							<description>Port 0_2 Wake-up on Falling Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_1</name>
							<description>Port 0_1 Wake-up on Falling Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_0</name>
							<description>Port 0_0 Wake-up on Falling Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO0_CYC</name>
					<description>Wake Port 0 Cycle Enabled Register</description>
					<addressOffset>0xE0</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_CYC_4</name>
							<description>GPIO0_4 input for cycle sense enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_3</name>
							<description>GPIO0_3 input for cycle sense enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_2</name>
							<description>GPIO0_2 input for cycle sense enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_1</name>
							<description>GPIO0_1 input for cycle sense enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_0</name>
							<description>GPIO0_0 input for cycle sense enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO1_RISE</name>
					<description>Wake Configuration GPIO Port 1 Rising Edge Register</description>
					<addressOffset>0xE4</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_RI_4</name>
							<description>Port 1_4 Wake-up on Rising Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_3</name>
							<description>Port 1_3 Wake-up on Rising Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_2</name>
							<description>Port 1_2 Wake-up on Rising Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_1</name>
							<description>Port 1_1 Wake-up on Rising Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_0</name>
							<description>Port 1_0 Wake-up on Rising Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO1_FALL</name>
					<description>Wake Configuration GPIO Port 1 Falling Edge Register</description>
					<addressOffset>0xE8</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_FA_4</name>
							<description>Port 1_4 Wake-up on Falling Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_3</name>
							<description>Port 1_3 Wake-up on Falling Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_2</name>
							<description>Port 1_2 Wake-up on Falling Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_1</name>
							<description>Port 1_1 Wake-up on Falling Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_0</name>
							<description>Port 1_0 Wake-up on Falling Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO1_CYC</name>
					<description>Wake Port 1 Cycle Enabled Register</description>
					<addressOffset>0xEC</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_CYC_4</name>
							<description>GPIO1_4 input for cycle sense enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_3</name>
							<description>GPIO1_3 input for cycle sense enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_2</name>
							<description>GPIO1_2 input for cycle sense enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_1</name>
							<description>GPIO1_1 input for cycle sense enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_0</name>
							<description>GPIO1_0 input for cycle sense enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_WAKE_FILTER</name>
					<description>PMU Wake-up Timing Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>CNF_GPIO_FT</name>
							<description>Wake-up Filter time for General Purpose IO</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10_us</name>
									<description>10 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_us</name>
									<description>5 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_MON_FT</name>
							<description>Wake-up Filter time for Monitoring Inputs</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_LIN_FT</name>
							<description>Wake-up Filter time for LIN WAKE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>30_us</name>
									<description>30 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50_us</name>
									<description>50 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LIN_WAKE_EN</name>
					<description>LIN Wake Enable</description>
					<addressOffset>0x050</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>LIN_EN</name>
							<description>Lin Wake enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STATUS</name>
					<description>Main wake status register</description>
					<addressOffset>0x000</addressOffset>
					<size>8</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11000000</resetMask>
					<fields>
						<field>
							<name>FAIL</name>
							<description>Wake-up after VDDEXT Fail</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE</name>
							<description>Wake-up caused by Cyclic Wake</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1</name>
							<description>Wake-up via GPIO1 which is a logical OR combination of all Wake_STS_GPIO1 bits</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0</name>
							<description>Wake-up via GPIO0 which is a logical OR combination of all Wake_STS_GPIO0 bits</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_WAKE</name>
							<description>Wake-up via MON</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_WAKE</name>
							<description>Wake-up via LIN- Message</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
