alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
				<register>
					<name>DFSR</name>
					<description>Debug Fault Status Register</description>
					<addressOffset>0xD30</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXTERNAL</name>
							<description>External</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No EDBGRQ debug event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>EDBGRQ debug event</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCATCH</name>
							<description>Vector Catch</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No vector catch triggered</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Vector catch triggered</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DWTTRAP</name>
							<description>DWTTRAP</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No current debug event generated by the DWT</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>At least one current debug event generated by the DWT</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BKPT</name>
							<description>BKPT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No current breakpoint debug event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>At least one current breakpoint debug event</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HALTED</name>
							<description>HALTED</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No active halt request debug event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Halt request debug event active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MMFAR</name>
					<description>MemManage Fault Status Register</description>
					<addressOffset>0xD34</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ADDRESS</name>
							<description>Data Address for an MPU Fault</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BFAR</name>
					<description>Bus Fault Status Register</description>
					<addressOffset>0xD38</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ADDRESS</name>
							<description>Data Address for a precise BusFault</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFSR</name>
					<description>Auxiliary Fault Status Register</description>
					<addressOffset>0xD3C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CP0</name>
							<description>Access Privileges for Coprocessor 0 (n= 0-7, 10, 11)</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP1</name>
							<description>Access Privileges for Coprocessor 1 (n= 0-7, 10, 11)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP2</name>
							<description>Access Privileges for Coprocessor 2 (n= 0-7, 10, 11)</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP3</name>
							<description>Access Privileges for Coprocessor 3 (n= 0-7, 10, 11)</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP4</name>
							<description>Access Privileges for Coprocessor 4 (n= 0-7, 10, 11)</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP5</name>
							<description>Access Privileges for Coprocessor 5 (n= 0-7, 10, 11)</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP6</name>
							<description>Access Privileges for Coprocessor 6 (n= 0-7, 10, 11)</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP7</name>
							<description>Access Privileges for Coprocessor 7 (n= 0-7, 10, 11)</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP10</name>
							<description>Access Privileges for Coprocessor 10 (n= 0-7, 10, 11)</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP11</name>
							<description>Access Privileges for Coprocessor 11 (n= 0-7, 10, 11)</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
