alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MF</name>
			<description>MF</description>
			<baseAddress>0x48018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>P2_ADCSEL_CTRL</name>
					<description>Port 2 ADC Selection Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC1_CH1_SEL</name>
							<description>ADC1 Channel 1 Input Selection</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CS_AMP</name>
									<description>Current Sense Amplifier is conncted to Ch1 of ADC1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VMON_SEN_CTRL</name>
					<description>Supply Sense Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VMON_SEN_SEL_INRANGE</name>
							<description>Monitoring Input Attenuator Select Inputrange</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0 - 18V Range</name>
									<description>is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0 - 28V Range</name>
									<description>is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VMON_SEN_HRESO_5V</name>
							<description>Monitoring Input Attenuator High Impedance Output Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>High Resistive Output Disable</name>
									<description>Connection to ADC input low ohmic</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High Resistive Output Enable</name>
									<description>Connection to ADC input high ohmic</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VMON_SEN_PD_N</name>
							<description>Monitoring Input Attenuator enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Attenuator switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Attenuator switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TEMPSENSE_CTRL</name>
					<description>Temperature Sensor Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SYS_OT_STS</name>
							<description>System Overtemperature (MU) Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_STS</name>
							<description>System Overtemperature Warning (MU) Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_STS</name>
							<description>PMU Regulator Overtemperature (MU) Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OTWARN_STS</name>
							<description>PMU Regulator Overtemperature Warning (MU) Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>REF1_STS</name>
					<description>Reference 1 Status Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x000000C1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REFBG_UPTHWARN_STS</name>
							<description>Status for Overvoltage Threshold Measurement of internal VAREF</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_TRIG_RESET</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_TRIG_SET</name>
									<description>trigger status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_LOTHWARN_STS</name>
							<description>Status for Undervoltage Threshold Measurement of internal VAREF</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_TRIG_RESET</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_TRIG_SET</name>
									<description>trigger status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>REF2_CTRL</name>
					<description>Reference 2 Control Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VREF5V_OV_STS</name>
							<description>ADC1 Bit Reference Voltage Generation Overvoltage Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overvoltage</name>
									<description>no Overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>Overvoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_UV_STS</name>
							<description>ADC1 Bit Reference Voltage Generation Undervoltage Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Undervoltage</name>
									<description>no Undervoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>Undervoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_OVL_STS</name>
							<description>ADC1 Bit Reference Voltage Generation Over Load Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no OVERLOAD</name>
									<description>no OVERLOAD detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERLOAD</name>
									<description>OVERLOAD detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_PD_N</name>
							<description>ADC1 Bit Reference Voltage Generation Power Down Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Power Down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>no Power Down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CSA_CTRL</name>
					<description>Current Sense Amplifier Control Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VZERO</name>
							<description>Current Sense Output Voltage Level to Ground</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VOUT</name>
									<description>Output Voltage is VOUT of Amplifier</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GROUND</name>
									<description>Output Voltage is Ground of Feedback Network</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GAIN</name>
							<description>OPA gain setting</description>
							<lsb>1</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>GMIN</name>
									<description>TBD</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GMAX</name>
									<description>TBD</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>OPA enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>OPA switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>OPA switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
