alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC2</name>
			<description>ADC2</description>
			<baseAddress>0x4801C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL_STS</name>
					<description>ADC2 Control and Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VS_RANGE</name>
							<description>ADC2 Channel 1 Range Selection</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Range 1</name>
									<description>Range from 3 to 22 V is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Range 2</name>
									<description>Range from 3 to 28 V is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_RANGE</name>
							<description>ADC2 Channel 0 Range Selection</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Range 1</name>
									<description>Range from 3 to 22 V is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Range 2</name>
									<description>Range from 3 to 28 V is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HV_STS</name>
					<description>ADC2 HV Status Register</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>READY</name>
							<description>HVADC Ready bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not ready</name>
									<description>Module in power down or in init phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ready</name>
									<description>set automatically 5 ADC clock cycles after module is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL1</name>
					<description>Measurement Unit Control Register 1</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CALIB_EN</name>
							<description>Calibration Enable for Channels 0 to 5</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 calibration enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 calibration enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 calibration enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 calibration enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 calibration enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 calibration enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<description>Measurement Unit Control Register 2</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x000F0805</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SAMPLE_TIME_int</name>
							<description>Sample time of ADC2</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MICLK4</name>
									<description>4 MI_CLK clock periods</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK6</name>
									<description>6 MI_CLK clock periods</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK8</name>
									<description>8 MI_CLK clock periods</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK10</name>
									<description>10 MI_CLK clock periods</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK12</name>
									<description>12 MI_CLK clock periods (default)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK14</name>
									<description>14 MI_CLK clock periods</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK16</name>
									<description>16 MI_CLK clock periods</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK18</name>
									<description>18 MI_CLK clock periods</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK20</name>
									<description>20 MI_CLK clock periods</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK22</name>
									<description>22 MI_CLK clock periods</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>n.u.</name>
									<description>not used</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>n.u.</name>
									<description>not used</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>n.u.</name>
									<description>not used</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>n.u.</name>
									<description>not used</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>n.u.</name>
									<description>not used</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>n.u.</name>
									<description>not used</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_RDY</name>
							<description>Ready Signal for MCM after Power On or Reset</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Not Ready</name>
									<description>Measurement Core Module in startup phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Ready</name>
									<description>Measurement Core Module start-up phase finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_PD_N</name>
							<description>Power Down Signal for MCM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Disabled</name>
									<description>Measurement Core Module Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Enabled</name>
									<description>Measurement Core Module Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL4</name>
					<description>Measurement Unit Control Register 4</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FILT_OUT_SEL_9_6</name>
							<description>Output Filter Selection for Channels 6 to 9</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC2 Unfiltered Data</name>
									<description>can be monitored in the corresponding ADC2_FILT_OUTx Registers.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 6 IIR Data enabled for ADC2_FILT_OUT6 Register</name>
									<description>.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 7 IIR Data enabled for ADC2_FILT_OUT7 Register</name>
									<description>.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 8 IIR Data enabled for ADC2_FILT_OUT8 Register</name>
									<description>.</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 9 IIR Data enabled for ADC2_FILT_OUT9 Register</name>
									<description>.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>For Channels 9-6 IIR Data is enabled for ADC2_FILT_OUTx Registers</name>
									<description>.</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_SEL_5_0</name>
							<description>Output Filter Selection for Channels 0 to 5</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC2 Unfiltered D ata can be monitored in the corresponding ADC2_FILT_OUTx Registers</name>
									<description>.</description>
									<value>0b000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 0 IIR Data enabled for ADC2_FILT_OUT0 Register</name>
									<description>.</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 1 IIR Data enabled for ADC2_FILT_OUT1 Register</name>
									<description>.</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 2 IIR Data enabled for ADC2_FILT_OUT2 Register</name>
									<description>.</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 3 IIR Data enabled for ADC2_FILT_OUT3 Register</name>
									<description>.</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 4 IIR Data enabled for ADC2_FILT_OUT4 Register</name>
									<description>.</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 5 IIR Data enabled for ADC2_FILT_OUT5 Register</name>
									<description>.</description>
									<value>0b100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>For Channels 5-0 IIR Data is enabled for ADC2_FILT_OUTx Registers</name>
									<description>.</description>
									<value>0b111111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ1_4</name>
					<description>Measurement Channel Enable Bits for Cycle 1-4</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x29362837</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SQ4</name>
							<description>Sequence 4 channel enable</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ3</name>
							<description>Sequence 3 channel enable</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ2</name>
							<description>Sequence 2 channel enable</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ1</name>
							<description>Sequence 1 channel enable</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
