alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
				<register>
					<name>DWSEL</name>
					<description>Measurement Channel Data Width Selection</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ch7</name>
							<description>Data Width channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch6</name>
							<description>Data Width channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch5</name>
							<description>Data Width channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch4</name>
							<description>Data Width channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch3</name>
							<description>Data Width channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch2</name>
							<description>Data Width channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch1</name>
							<description>Data Width channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch0</name>
							<description>Data Width channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STC_0_3</name>
					<description>Measurement Channel Sample Time Control 0 - 3</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ch3</name>
							<description>Sample Time Control for Channel 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch2</name>
							<description>Sample Time Control for Channel 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch1</name>
							<description>Sample Time Control for Channel 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch0</name>
							<description>Sample Time Control for Channel 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STC_4_7</name>
					<description>Measurement Channel Sample Time Control 4 - 7</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ch7</name>
							<description>Sample Time Control for Channel 7</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch6</name>
							<description>Sample Time Control for Channel 6</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch5</name>
							<description>Sample Time Control for Channel 5</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch4</name>
							<description>Sample Time Control for Channel 4</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ_FB</name>
					<description>Sequencer Feedback Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CHx</name>
							<description>Current Channel</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0</name>
									<description>Channel 0</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Channel 1</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Channel 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Channel 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Channel 4</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Channel 5</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6</name>
									<description>Channel 6</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7</name>
									<description>Channel 7</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQx</name>
							<description>Current Active Sequence in Sequencer Mode</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_ACTIVE</name>
							<description>ADC1 ESM active</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>ESM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>ESM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ACTIVE</name>
							<description>ADC1 EIM active</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>EIM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>EIM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_RUN</name>
							<description>ADC1 Sequencer RUN</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ Stopped</name>
									<description>Postprocessing Sequencer in stopped / Software mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ Running</name>
									<description>Postprocessing Sequencer is running</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_EIM</name>
					<description>Channel Settings Bits for Exceptional Interrupt Measurement</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (EIM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<description>.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<description>.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU_6_INT</name>
									<description>ccu6_int</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REP</name>
							<description>Repeat count for exceptional interrupt measurement (EIM)</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Measurement</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Measurements</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Measurements</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Measurements</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Measurements</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Measurements</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>Measurements</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>Measurements</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHx</name>
							<description>Channel set for exceptional interrupt measurement (EIM)</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_ESM</name>
					<description>Channel Settings Bits for Exceptional Sequence Measurement</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (ESM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<description>.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<description>.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU_6_INT</name>
									<description>ccu6_int</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_0</name>
							<description>Channel Sequence for Exceptional Sequence Measurement (ESM)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b00000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b00001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b00010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b00100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b01000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b10000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RES_OUT0</name>
					<description>ADC1 Output Channel 0</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFF000</resetMask>
					<fields>
						<field>
							<name>OF0</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF0</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR0</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT_CH0</name>
							<description>ADC1 output reset value channel 0</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
