alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE986x.svd
				<register>
					<name>CTRL2</name>
					<description>H-Bridge Driver Control 2</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLY_DIAG_DIRSEL</name>
							<description>Ext. power diag timer on / off select</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TURN OFF</name>
									<description>measure turn on time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TURN ON</name>
									<description>measure turn off time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_CHSEL</name>
							<description>Ext. power on/off timer channel select</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>diag timer deactivated.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB1 LS select</name>
									<description>measure LS1 on/off delay time.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB2 LS select</name>
									<description>measure LS2 on/off delay time.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>diag timer deactivated.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB1 HS select</name>
									<description>measure HS1 on/off delay time.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB2 HS select</name>
									<description>measure HS2 on/off delay time.</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_STS</name>
							<description>Ext. power diag timer valid flag</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Diag timer invalid</name>
									<description>diag timer measurement ongoing</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Diag timer valid</name>
									<description>diag timer measurement finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_SCLR</name>
							<description>Ext. power diag timer valid flag clear</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Diag timer valid not clear</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Diag timer valid clear</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_TIM</name>
							<description>Ext. power on/off diag timer result register</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL3</name>
					<description>H-Bridge Driver Control 3</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00011111</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEQ_ERR_STS</name>
							<description>Driver Sequence Error Status</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Sequence ok</name>
									<description>no cross current</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Sequence fail</name>
									<description>HS and LS of same bridge concurrently activated, output protection activated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEQ_ERR_SCLR</name>
							<description>Driver Sequence Error Status Clear</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Sequence Status no clear</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Sequence Status clear</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_CCP_DIS</name>
							<description>Dynamic cross conduction protection Disable</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCP Enable</name>
									<description>dynamic ccp is active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCP Disable</name>
									<description>dynamic ccp is disabled, delayed gate clamp remains active.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_CCP_TIMSEL</name>
							<description>minimum cross conduction protection time setting</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0.2us</name>
									<description>200ns cross conduction protection time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.4us</name>
									<description>400ns cross conduction protection time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.8us</name>
									<description>800ns cross conduction protection time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.6us</name>
									<description>1.6us cross conduction protection time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSMONVTH</name>
							<description>Voltage Threshold for Drain-Source Monitoring of external FETs</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0.5_V</name>
									<description>Threshold 0 for VDS at 0.5 V</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.75_V</name>
									<description>Threshold 1 for VDS at 0.75 V</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.0_V</name>
									<description>Threshold 2 for VDS at 1.0 V</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.25_V</name>
									<description>Threshold 3 for VDS at 1.25 V</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.5_V</name>
									<description>Threshold 4 for VDS at 1.5 V</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.75_V</name>
									<description>Threshold 5 for VDS at 1.75 V</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2.0_V</name>
									<description>Threshold 6 for VDS at 2.0 V</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2.25_V</name>
									<description>Threshold 7 for VDS at 2.25 V</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFF_SEQ_EN</name>
							<description>Turn Off Slewrate Sequencer enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Turn Off Slewrate Sequencer disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Turn Off Slewrate Sequencer enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDISCHARGEDIV2_N</name>
							<description>IDISCHARGE Current divide by 2 not</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Half Range</name>
									<description>available for charge current (max. is 150 mA)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Full Range</name>
									<description>available for charge current (max. is 300 mA)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDISCHARGE_TRIM</name>
							<description>Trimming of the internal driver dis-charge current</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HiZ</name>
									<description>Slew Rate Control is inactive</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>min discharge rate</name>
									<description>lowest gate charge current selected</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max discharge rate</name>
									<description>max gate charge current is selected</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ON_SEQ_EN</name>
							<description>Turn On SlewrateSequencer enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Turn On Slewrate Sequencer disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Turn On Slewrate Sequencer enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICHARGEDIV2_N</name>
							<description>ICHARGE Current divide by 2 not</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Half Range</name>
									<description>available for charge current (max. is 150 mA)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Full Range</name>
									<description>available for charge current (max. is 300 mA)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICHARGE_TRIM</name>
							<description>Trimming of the internal driver charge current</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HiZ</name>
									<description>Slew Rate Control is inactive</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>min charge rate</name>
									<description>lowest gate discharge current selected</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max charge rate</name>
									<description>max gate discharge current is selected</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFF_SEQ_CTRL</name>
					<description>Turn on Slewrate Sequencer Control</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRV_OFF_I_1</name>
							<description>Slew rate sequencer off phase 1 current</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_1</name>
							<description>Slew rate sequencer off phase 1 time</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_2</name>
							<description>Slew rate sequencer off phase 2 current</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_2</name>
							<description>Slew rate sequencer off phase 2 time</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_3</name>
							<description>Slew rate sequencer off phase 3 current</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_3</name>
							<description>Slew rate sequencer off phase 3 time</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_4</name>
							<description>Slew rate sequencer off phase 4 current</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_4</name>
							<description>Slew rate sequencer off phase 4 time</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ON_SEQ_CTRL</name>
					<description>Turn off Slewrate Sequencer Control</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRV_ON_I_1</name>
							<description>Slew rate sequencer on phase 1 current</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_1</name>
							<description>Slew rate sequencer on phase 1 time</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_2</name>
							<description>Slew rate sequencer on phase 2 current</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_2</name>
							<description>Slew rate sequencer on phase 2 time</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_3</name>
							<description>Slew rate sequencer on phase 3 current</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_3</name>
							<description>Slew rate sequencer on phase 3 time</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_4</name>
							<description>Slew rate sequencer on phase 4 current</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_4</name>
							<description>Slew rate sequencer on phase 4 time</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
